littlekernel/lk/external/platform/TivaWare_C_Series-2.2.0.295/inc/tm4c129cncpdt.h
//*****************************************************************************
//
// System Control registers (SYSCTL)
//
//*****************************************************************************
#define SYSCTL_DID0_R           (*((volatile uint32_t *)0x400FE000))
#define SYSCTL_DID1_R           (*((volatile uint32_t *)0x400FE004))
#define SYSCTL_PTBOCTL_R        (*((volatile uint32_t *)0x400FE038))
#define SYSCTL_RIS_R            (*((volatile uint32_t *)0x400FE050))
#define SYSCTL_IMC_R            (*((volatile uint32_t *)0x400FE054))
#define SYSCTL_MISC_R           (*((volatile uint32_t *)0x400FE058))
#define SYSCTL_RESC_R           (*((volatile uint32_t *)0x400FE05C))
#define SYSCTL_PWRTC_R          (*((volatile uint32_t *)0x400FE060))
#define SYSCTL_NMIC_R           (*((volatile uint32_t *)0x400FE064))
#define SYSCTL_MOSCCTL_R        (*((volatile uint32_t *)0x400FE07C))
#define SYSCTL_RSCLKCFG_R       (*((volatile uint32_t *)0x400FE0B0))
#define SYSCTL_MEMTIM0_R        (*((volatile uint32_t *)0x400FE0C0))
#define SYSCTL_ALTCLKCFG_R      (*((volatile uint32_t *)0x400FE138))
#define SYSCTL_DSCLKCFG_R       (*((volatile uint32_t *)0x400FE144))
#define SYSCTL_DIVSCLK_R        (*((volatile uint32_t *)0x400FE148))
#define SYSCTL_SYSPROP_R        (*((volatile uint32_t *)0x400FE14C))
#define SYSCTL_PIOSCCAL_R       (*((volatile uint32_t *)0x400FE150))
#define SYSCTL_PIOSCSTAT_R      (*((volatile uint32_t *)0x400FE154))
#define SYSCTL_PLLFREQ0_R       (*((volatile uint32_t *)0x400FE160))
#define SYSCTL_PLLFREQ1_R       (*((volatile uint32_t *)0x400FE164))
#define SYSCTL_PLLSTAT_R        (*((volatile uint32_t *)0x400FE168))
#define SYSCTL_SLPPWRCFG_R      (*((volatile uint32_t *)0x400FE188))
#define SYSCTL_DSLPPWRCFG_R     (*((volatile uint32_t *)0x400FE18C))
#define SYSCTL_NVMSTAT_R        (*((volatile uint32_t *)0x400FE1A0))
#define SYSCTL_LDOSPCTL_R       (*((volatile uint32_t *)0x400FE1B4))
#define SYSCTL_LDODPCTL_R       (*((volatile uint32_t *)0x400FE1BC))
#define SYSCTL_RESBEHAVCTL_R    (*((volatile uint32_t *)0x400FE1D8))
#define SYSCTL_HSSR_R           (*((volatile uint32_t *)0x400FE1F4))
#define SYSCTL_USBPDS_R         (*((volatile uint32_t *)0x400FE280))
#define SYSCTL_USBMPC_R         (*((volatile uint32_t *)0x400FE284))
#define SYSCTL_PPWD_R           (*((volatile uint32_t *)0x400FE300))
#define SYSCTL_PPTIMER_R        (*((volatile uint32_t *)0x400FE304))
#define SYSCTL_PPGPIO_R         (*((volatile uint32_t *)0x400FE308))
#define SYSCTL_PPDMA_R          (*((volatile uint32_t *)0x400FE30C))
#define SYSCTL_PPEPI_R          (*((volatile uint32_t *)0x400FE310))
#define SYSCTL_PPHIB_R          (*((volatile uint32_t *)0x400FE314))
#define SYSCTL_PPUART_R         (*((volatile uint32_t *)0x400FE318))
#define SYSCTL_PPSSI_R          (*((volatile uint32_t *)0x400FE31C))
#define SYSCTL_PPI2C_R          (*((volatile uint32_t *)0x400FE320))
#define SYSCTL_PPUSB_R          (*((volatile uint32_t *)0x400FE328))
#define SYSCTL_PPEPHY_R         (*((volatile uint32_t *)0x400FE330))
#define SYSCTL_PPCAN_R          (*((volatile uint32_t *)0x400FE334))
#define SYSCTL_PPADC_R          (*((volatile uint32_t *)0x400FE338))
#define SYSCTL_PPACMP_R         (*((volatile uint32_t *)0x400FE33C))
#define SYSCTL_PPPWM_R          (*((volatile uint32_t *)0x400FE340))
#define SYSCTL_PPQEI_R          (*((volatile uint32_t *)0x400FE344))
#define SYSCTL_PPLPC_R          (*((volatile uint32_t *)0x400FE348))
#define SYSCTL_PPPECI_R         (*((volatile uint32_t *)0x400FE350))
#define SYSCTL_PPFAN_R          (*((volatile uint32_t *)0x400FE354))
#define SYSCTL_PPEEPROM_R       (*((volatile uint32_t *)0x400FE358))
#define SYSCTL_PPWTIMER_R       (*((volatile uint32_t *)0x400FE35C))
#define SYSCTL_PPRTS_R          (*((volatile uint32_t *)0x400FE370))
#define SYSCTL_PPCCM_R          (*((volatile uint32_t *)0x400FE374))
#define SYSCTL_PPLCD_R          (*((volatile uint32_t *)0x400FE390))
#define SYSCTL_PPOWIRE_R        (*((volatile uint32_t *)0x400FE398))
#define SYSCTL_PPEMAC_R         (*((volatile uint32_t *)0x400FE39C))
#define SYSCTL_PPHIM_R          (*((volatile uint32_t *)0x400FE3A4))
#define SYSCTL_SRWD_R           (*((volatile uint32_t *)0x400FE500))
#define SYSCTL_SRTIMER_R        (*((volatile uint32_t *)0x400FE504))
#define SYSCTL_SRGPIO_R         (*((volatile uint32_t *)0x400FE508))
#define SYSCTL_SRDMA_R          (*((volatile uint32_t *)0x400FE50C))
#define SYSCTL_SREPI_R          (*((volatile uint32_t *)0x400FE510))
#define SYSCTL_SRHIB_R          (*((volatile uint32_t *)0x400FE514))
#define SYSCTL_SRUART_R         (*((volatile uint32_t *)0x400FE518))
#define SYSCTL_SRSSI_R          (*((volatile uint32_t *)0x400FE51C))
#define SYSCTL_SRI2C_R          (*((volatile uint32_t *)0x400FE520))
#define SYSCTL_SRUSB_R          (*((volatile uint32_t *)0x400FE528))
#define SYSCTL_SRCAN_R          (*((volatile uint32_t *)0x400FE534))
#define SYSCTL_SRADC_R          (*((volatile uint32_t *)0x400FE538))
#define SYSCTL_SRACMP_R         (*((volatile uint32_t *)0x400FE53C))
#define SYSCTL_SRPWM_R          (*((volatile uint32_t *)0x400FE540))
#define SYSCTL_SRQEI_R          (*((volatile uint32_t *)0x400FE544))
#define SYSCTL_SREEPROM_R       (*((volatile uint32_t *)0x400FE558))
#define SYSCTL_SRCCM_R          (*((volatile uint32_t *)0x400FE574))
#define SYSCTL_RCGCWD_R         (*((volatile uint32_t *)0x400FE600))
#define SYSCTL_RCGCTIMER_R      (*((volatile uint32_t *)0x400FE604))
#define SYSCTL_RCGCGPIO_R       (*((volatile uint32_t *)0x400FE608))
#define SYSCTL_RCGCDMA_R        (*((volatile uint32_t *)0x400FE60C))
#define SYSCTL_RCGCEPI_R        (*((volatile uint32_t *)0x400FE610))
#define SYSCTL_RCGCHIB_R        (*((volatile uint32_t *)0x400FE614))
#define SYSCTL_RCGCUART_R       (*((volatile uint32_t *)0x400FE618))
#define SYSCTL_RCGCSSI_R        (*((volatile uint32_t *)0x400FE61C))
#define SYSCTL_RCGCI2C_R        (*((volatile uint32_t *)0x400FE620))
#define SYSCTL_RCGCUSB_R        (*((volatile uint32_t *)0x400FE628))
#define SYSCTL_RCGCCAN_R        (*((volatile uint32_t *)0x400FE634))
#define SYSCTL_RCGCADC_R        (*((volatile uint32_t *)0x400FE638))
#define SYSCTL_RCGCACMP_R       (*((volatile uint32_t *)0x400FE63C))
#define SYSCTL_RCGCPWM_R        (*((volatile uint32_t *)0x400FE640))
#define SYSCTL_RCGCQEI_R        (*((volatile uint32_t *)0x400FE644))
#define SYSCTL_RCGCEEPROM_R     (*((volatile uint32_t *)0x400FE658))
#define SYSCTL_RCGCCCM_R        (*((volatile uint32_t *)0x400FE674))
#define SYSCTL_SCGCWD_R         (*((volatile uint32_t *)0x400FE700))
#define SYSCTL_SCGCTIMER_R      (*((volatile uint32_t *)0x400FE704))
#define SYSCTL_SCGCGPIO_R       (*((volatile uint32_t *)0x400FE708))
#define SYSCTL_SCGCDMA_R        (*((volatile uint32_t *)0x400FE70C))
#define SYSCTL_SCGCEPI_R        (*((volatile uint32_t *)0x400FE710))
#define SYSCTL_SCGCHIB_R        (*((volatile uint32_t *)0x400FE714))
#define SYSCTL_SCGCUART_R       (*((volatile uint32_t *)0x400FE718))
#define SYSCTL_SCGCSSI_R        (*((volatile uint32_t *)0x400FE71C))
#define SYSCTL_SCGCI2C_R        (*((volatile uint32_t *)0x400FE720))
#define SYSCTL_SCGCUSB_R        (*((volatile uint32_t *)0x400FE728))
#define SYSCTL_SCGCCAN_R        (*((volatile uint32_t *)0x400FE734))
#define SYSCTL_SCGCADC_R        (*((volatile uint32_t *)0x400FE738))
#define SYSCTL_SCGCACMP_R       (*((volatile uint32_t *)0x400FE73C))
#define SYSCTL_SCGCPWM_R        (*((volatile uint32_t *)0x400FE740))
#define SYSCTL_SCGCQEI_R        (*((volatile uint32_t *)0x400FE744))
#define SYSCTL_SCGCEEPROM_R     (*((volatile uint32_t *)0x400FE758))
#define SYSCTL_SCGCCCM_R        (*((volatile uint32_t *)0x400FE774))
#define SYSCTL_DCGCWD_R         (*((volatile uint32_t *)0x400FE800))
#define SYSCTL_DCGCTIMER_R      (*((volatile uint32_t *)0x400FE804))
#define SYSCTL_DCGCGPIO_R       (*((volatile uint32_t *)0x400FE808))
#define SYSCTL_DCGCDMA_R        (*((volatile uint32_t *)0x400FE80C))
#define SYSCTL_DCGCEPI_R        (*((volatile uint32_t *)0x400FE810))
#define SYSCTL_DCGCHIB_R        (*((volatile uint32_t *)0x400FE814))
#define SYSCTL_DCGCUART_R       (*((volatile uint32_t *)0x400FE818))
#define SYSCTL_DCGCSSI_R        (*((volatile uint32_t *)0x400FE81C))
#define SYSCTL_DCGCI2C_R        (*((volatile uint32_t *)0x400FE820))
#define SYSCTL_DCGCUSB_R        (*((volatile uint32_t *)0x400FE828))
#define SYSCTL_DCGCCAN_R        (*((volatile uint32_t *)0x400FE834))
#define SYSCTL_DCGCADC_R        (*((volatile uint32_t *)0x400FE838))
#define SYSCTL_DCGCACMP_R       (*((volatile uint32_t *)0x400FE83C))
#define SYSCTL_DCGCPWM_R        (*((volatile uint32_t *)0x400FE840))
#define SYSCTL_DCGCQEI_R        (*((volatile uint32_t *)0x400FE844))
#define SYSCTL_DCGCEEPROM_R     (*((volatile uint32_t *)0x400FE858))
#define SYSCTL_DCGCCCM_R        (*((volatile uint32_t *)0x400FE874))
#define SYSCTL_PCWD_R           (*((volatile uint32_t *)0x400FE900))
#define SYSCTL_PCTIMER_R        (*((volatile uint32_t *)0x400FE904))
#define SYSCTL_PCGPIO_R         (*((volatile uint32_t *)0x400FE908))
#define SYSCTL_PCDMA_R          (*((volatile uint32_t *)0x400FE90C))
#define SYSCTL_PCEPI_R          (*((volatile uint32_t *)0x400FE910))
#define SYSCTL_PCHIB_R          (*((volatile uint32_t *)0x400FE914))
#define SYSCTL_PCUART_R         (*((volatile uint32_t *)0x400FE918))
#define SYSCTL_PCSSI_R          (*((volatile uint32_t *)0x400FE91C))
#define SYSCTL_PCI2C_R          (*((volatile uint32_t *)0x400FE920))
#define SYSCTL_PCUSB_R          (*((volatile uint32_t *)0x400FE928))
#define SYSCTL_PCCAN_R          (*((volatile uint32_t *)0x400FE934))
#define SYSCTL_PCADC_R          (*((volatile uint32_t *)0x400FE938))
#define SYSCTL_PCACMP_R         (*((volatile uint32_t *)0x400FE93C))
#define SYSCTL_PCPWM_R          (*((volatile uint32_t *)0x400FE940))
#define SYSCTL_PCQEI_R          (*((volatile uint32_t *)0x400FE944))
#define SYSCTL_PCEEPROM_R       (*((volatile uint32_t *)0x400FE958))
#define SYSCTL_PCCCM_R          (*((volatile uint32_t *)0x400FE974))
#define SYSCTL_PRWD_R           (*((volatile uint32_t *)0x400FEA00))
#define SYSCTL_PRTIMER_R        (*((volatile uint32_t *)0x400FEA04))
#define SYSCTL_PRGPIO_R         (*((volatile uint32_t *)0x400FEA08))
#define SYSCTL_PRDMA_R          (*((volatile uint32_t *)0x400FEA0C))
#define SYSCTL_PREPI_R          (*((volatile uint32_t *)0x400FEA10))
#define SYSCTL_PRHIB_R          (*((volatile uint32_t *)0x400FEA14))
#define SYSCTL_PRUART_R         (*((volatile uint32_t *)0x400FEA18))
#define SYSCTL_PRSSI_R          (*((volatile uint32_t *)0x400FEA1C))
#define SYSCTL_PRI2C_R          (*((volatile uint32_t *)0x400FEA20))
#define SYSCTL_PRUSB_R          (*((volatile uint32_t *)0x400FEA28))
#define SYSCTL_PRCAN_R          (*((volatile uint32_t *)0x400FEA34))
#define SYSCTL_PRADC_R          (*((volatile uint32_t *)0x400FEA38))
#define SYSCTL_PRACMP_R         (*((volatile uint32_t *)0x400FEA3C))
#define SYSCTL_PRPWM_R          (*((volatile uint32_t *)0x400FEA40))
#define SYSCTL_PRQEI_R          (*((volatile uint32_t *)0x400FEA44))
#define SYSCTL_PREEPROM_R       (*((volatile uint32_t *)0x400FEA58))
#define SYSCTL_PRCCM_R          (*((volatile uint32_t *)0x400FEA74))
#define SYSCTL_CCMCGREQ_R       (*((volatile uint32_t *)0x44030204))

//*****************************************************************************
//
// Micro Direct Memory Access registers (UDMA)
//
//*****************************************************************************
#define UDMA_STAT_R             (*((volatile uint32_t *)0x400FF000))
#define UDMA_CFG_R              (*((volatile uint32_t *)0x400FF004))
#define UDMA_CTLBASE_R          (*((volatile uint32_t *)0x400FF008))
#define UDMA_ALTBASE_R          (*((volatile uint32_t *)0x400FF00C))
#define UDMA_WAITSTAT_R         (*((volatile uint32_t *)0x400FF010))
#define UDMA_SWREQ_R            (*((volatile uint32_t *)0x400FF014))
#define UDMA_USEBURSTSET_R      (*((volatile uint32_t *)0x400FF018))
#define UDMA_USEBURSTCLR_R      (*((volatile uint32_t *)0x400FF01C))
#define UDMA_REQMASKSET_R       (*((volatile uint32_t *)0x400FF020))
#define UDMA_REQMASKCLR_R       (*((volatile uint32_t *)0x400FF024))
#define UDMA_ENASET_R           (*((volatile uint32_t *)0x400FF028))
#define UDMA_ENACLR_R           (*((volatile uint32_t *)0x400FF02C))
#define UDMA_ALTSET_R           (*((volatile uint32_t *)0x400FF030))
#define UDMA_ALTCLR_R           (*((volatile uint32_t *)0x400FF034))
#define UDMA_PRIOSET_R          (*((volatile uint32_t *)0x400FF038))
#define UDMA_PRIOCLR_R          (*((volatile uint32_t *)0x400FF03C))
#define UDMA_ERRCLR_R           (*((volatile uint32_t *)0x400FF04C))
#define UDMA_CHASGN_R           (*((volatile uint32_t *)0x400FF500))
#define UDMA_CHMAP0_R           (*((volatile uint32_t *)0x400FF510))
#define UDMA_CHMAP1_R           (*((volatile uint32_t *)0x400FF514))
#define UDMA_CHMAP2_R           (*((volatile uint32_t *)0x400FF518))
#define UDMA_CHMAP3_R           (*((volatile uint32_t *)0x400FF51C))

//*****************************************************************************
//
// Micro Direct Memory Access (uDMA) offsets (UDMA)
//
//*****************************************************************************
#define UDMA_SRCENDP            0x00000000  // DMA Channel Source Address End
                                            // Pointer
#define UDMA_DSTENDP            0x00000004  // DMA Channel Destination Address
                                            // End Pointer
#define UDMA_CHCTL              0x00000008  // DMA Channel Control Word

//*****************************************************************************
//
// EC registers (CCM0)
//
//*****************************************************************************
#define CCM0_CRCCTRL_R          (*((volatile uint32_t *)0x44030400))
#define CCM0_CRCSEED_R          (*((volatile uint32_t *)0x44030410))
#define CCM0_CRCDIN_R           (*((volatile uint32_t *)0x44030414))
#define CCM0_CRCRSLTPP_R        (*((volatile uint32_t *)0x44030418))

//*****************************************************************************
//
// SHA/MD5 registers (SHAMD5)
//
//*****************************************************************************
#define SHAMD5_ODIGEST_A_R      (*((volatile uint32_t *)0x44034000))
#define SHAMD5_ODIGEST_B_R      (*((volatile uint32_t *)0x44034004))
#define SHAMD5_ODIGEST_C_R      (*((volatile uint32_t *)0x44034008))
#define SHAMD5_ODIGEST_D_R      (*((volatile uint32_t *)0x4403400C))
#define SHAMD5_ODIGEST_E_R      (*((volatile uint32_t *)0x44034010))
#define SHAMD5_ODIGEST_F_R      (*((volatile uint32_t *)0x44034014))
#define SHAMD5_ODIGEST_G_R      (*((volatile uint32_t *)0x44034018))
#define SHAMD5_ODIGEST_H_R      (*((volatile uint32_t *)0x4403401C))
#define SHAMD5_IDIGEST_A_R      (*((volatile uint32_t *)0x44034020))
#define SHAMD5_IDIGEST_B_R      (*((volatile uint32_t *)0x44034024))
#define SHAMD5_IDIGEST_C_R      (*((volatile uint32_t *)0x44034028))
#define SHAMD5_IDIGEST_D_R      (*((volatile uint32_t *)0x4403402C))
#define SHAMD5_IDIGEST_E_R      (*((volatile uint32_t *)0x44034030))
#define SHAMD5_IDIGEST_F_R      (*((volatile uint32_t *)0x44034034))
#define SHAMD5_IDIGEST_G_R      (*((volatile uint32_t *)0x44034038))
#define SHAMD5_IDIGEST_H_R      (*((volatile uint32_t *)0x4403403C))
#define SHAMD5_DIGEST_COUNT_R   (*((volatile uint32_t *)0x44034040))
#define SHAMD5_MODE_R           (*((volatile uint32_t *)0x44034044))
#define SHAMD5_LENGTH_R         (*((volatile uint32_t *)0x44034048))
#define SHAMD5_DATA_0_IN_R      (*((volatile uint32_t *)0x44034080))
#define SHAMD5_DATA_1_IN_R      (*((volatile uint32_t *)0x44034084))
#define SHAMD5_DATA_2_IN_R      (*((volatile uint32_t *)0x44034088))
#define SHAMD5_DATA_3_IN_R      (*((volatile uint32_t *)0x4403408C))
#define SHAMD5_DATA_4_IN_R      (*((volatile uint32_t *)0x44034090))
#define SHAMD5_DATA_5_IN_R      (*((volatile uint32_t *)0x44034094))
#define SHAMD5_DATA_6_IN_R      (*((volatile uint32_t *)0x44034098))
#define SHAMD5_DATA_7_IN_R      (*((volatile uint32_t *)0x4403409C))
#define SHAMD5_DATA_8_IN_R      (*((volatile uint32_t *)0x440340A0))
#define SHAMD5_DATA_9_IN_R      (*((volatile uint32_t *)0x440340A4))
#define SHAMD5_DATA_10_IN_R     (*((volatile uint32_t *)0x440340A8))
#define SHAMD5_DATA_11_IN_R     (*((volatile uint32_t *)0x440340AC))
#define SHAMD5_DATA_12_IN_R     (*((volatile uint32_t *)0x440340B0))
#define SHAMD5_DATA_13_IN_R     (*((volatile uint32_t *)0x440340B4))
#define SHAMD5_DATA_14_IN_R     (*((volatile uint32_t *)0x440340B8))
#define SHAMD5_DATA_15_IN_R     (*((volatile uint32_t *)0x440340BC))
#define SHAMD5_REVISION_R       (*((volatile uint32_t *)0x44034100))
#define SHAMD5_SYSCONFIG_R      (*((volatile uint32_t *)0x44034110))
#define SHAMD5_SYSSTATUS_R      (*((volatile uint32_t *)0x44034114))
#define SHAMD5_IRQSTATUS_R      (*((volatile uint32_t *)0x44034118))
#define SHAMD5_IRQENABLE_R      (*((volatile uint32_t *)0x4403411C))
#define SHAMD5_DMAIM_R          (*((volatile uint32_t *)0x144030010))
#define SHAMD5_DMARIS_R         (*((volatile uint32_t *)0x144030014))
#define SHAMD5_DMAMIS_R         (*((volatile uint32_t *)0x144030018))
#define SHAMD5_DMAIC_R          (*((volatile uint32_t *)0x14403001C))

//*****************************************************************************
//
// AES registers (AES)
//
//*****************************************************************************
#define AES_KEY2_6_R            (*((volatile uint32_t *)0x44036000))
#define AES_KEY2_7_R            (*((volatile uint32_t *)0x44036004))
#define AES_KEY2_4_R            (*((volatile uint32_t *)0x44036008))
#define AES_KEY2_5_R            (*((volatile uint32_t *)0x4403600C))
#define AES_KEY2_2_R            (*((volatile uint32_t *)0x44036010))
#define AES_KEY2_3_R            (*((volatile uint32_t *)0x44036014))
#define AES_KEY2_0_R            (*((volatile uint32_t *)0x44036018))
#define AES_KEY2_1_R            (*((volatile uint32_t *)0x4403601C))
#define AES_KEY1_6_R            (*((volatile uint32_t *)0x44036020))
#define AES_KEY1_7_R            (*((volatile uint32_t *)0x44036024))
#define AES_KEY1_4_R            (*((volatile uint32_t *)0x44036028))
#define AES_KEY1_5_R            (*((volatile uint32_t *)0x4403602C))
#define AES_KEY1_2_R            (*((volatile uint32_t *)0x44036030))
#define AES_KEY1_3_R            (*((volatile uint32_t *)0x44036034))
#define AES_KEY1_0_R            (*((volatile uint32_t *)0x44036038))
#define AES_KEY1_1_R            (*((volatile uint32_t *)0x4403603C))
#define AES_IV_IN_0_R           (*((volatile uint32_t *)0x44036040))
#define AES_IV_IN_1_R           (*((volatile uint32_t *)0x44036044))
#define AES_IV_IN_2_R           (*((volatile uint32_t *)0x44036048))
#define AES_IV_IN_3_R           (*((volatile uint32_t *)0x4403604C))
#define AES_CTRL_R              (*((volatile uint32_t *)0x44036050))
#define AES_C_LENGTH_0_R        (*((volatile uint32_t *)0x44036054))
#define AES_C_LENGTH_1_R        (*((volatile uint32_t *)0x44036058))
#define AES_AUTH_LENGTH_R       (*((volatile uint32_t *)0x4403605C))
#define AES_DATA_IN_0_R         (*((volatile uint32_t *)0x44036060))
#define AES_DATA_IN_1_R         (*((volatile uint32_t *)0x44036064))
#define AES_DATA_IN_2_R         (*((volatile uint32_t *)0x44036068))
#define AES_DATA_IN_3_R         (*((volatile uint32_t *)0x4403606C))
#define AES_TAG_OUT_0_R         (*((volatile uint32_t *)0x44036070))
#define AES_TAG_OUT_1_R         (*((volatile uint32_t *)0x44036074))
#define AES_TAG_OUT_2_R         (*((volatile uint32_t *)0x44036078))
#define AES_TAG_OUT_3_R         (*((volatile uint32_t *)0x4403607C))
#define AES_REVISION_R          (*((volatile uint32_t *)0x44036080))
#define AES_SYSCONFIG_R         (*((volatile uint32_t *)0x44036084))
#define AES_SYSSTATUS_R         (*((volatile uint32_t *)0x44036088))
#define AES_IRQSTATUS_R         (*((volatile uint32_t *)0x4403608C))
#define AES_IRQENABLE_R         (*((volatile uint32_t *)0x44036090))
#define AES_DIRTYBITS_R         (*((volatile uint32_t *)0x44036094))
#define AES_DMAIM_R             (*((volatile uint32_t *)0x144030020))
#define AES_DMARIS_R            (*((volatile uint32_t *)0x144030024))
#define AES_DMAMIS_R            (*((volatile uint32_t *)0x144030028))
#define AES_DMAIC_R             (*((volatile uint32_t *)0x14403002C))

//*****************************************************************************
//
// DES registers (DES)
//
//*****************************************************************************
#define DES_KEY3_L_R            (*((volatile uint32_t *)0x44038000))
#define DES_KEY3_H_R            (*((volatile uint32_t *)0x44038004))
#define DES_KEY2_L_R            (*((volatile uint32_t *)0x44038008))
#define DES_KEY2_H_R            (*((volatile uint32_t *)0x4403800C))
#define DES_KEY1_L_R            (*((volatile uint32_t *)0x44038010))
#define DES_KEY1_H_R            (*((volatile uint32_t *)0x44038014))
#define DES_IV_L_R              (*((volatile uint32_t *)0x44038018))
#define DES_IV_H_R              (*((volatile uint32_t *)0x4403801C))
#define DES_CTRL_R              (*((volatile uint32_t *)0x44038020))
#define DES_LENGTH_R            (*((volatile uint32_t *)0x44038024))
#define DES_DATA_L_R            (*((volatile uint32_t *)0x44038028))
#define DES_DATA_H_R            (*((volatile uint32_t *)0x4403802C))
#define DES_REVISION_R          (*((volatile uint32_t *)0x44038030))
#define DES_SYSCONFIG_R         (*((volatile uint32_t *)0x44038034))
#define DES_SYSSTATUS_R         (*((volatile uint32_t *)0x44038038))
#define DES_IRQSTATUS_R         (*((volatile uint32_t *)0x4403803C))
#define DES_IRQENABLE_R         (*((volatile uint32_t *)0x44038040))
#define DES_DIRTYBITS_R         (*((volatile uint32_t *)0x44038044))
#define DES_DMAIM_R             (*((volatile uint32_t *)0x144030030))
#define DES_DMARIS_R            (*((volatile uint32_t *)0x144030034))
#define DES_DMAMIS_R            (*((volatile uint32_t *)0x144030038))
#define DES_DMAIC_R             (*((volatile uint32_t *)0x14403003C))

